# UpdateFeatureLayer

## Description
Upload data from a Vectorworks layer to a feature service. Ensure that you have the proper permissions to modify the online data and that you are logged into the service.

```pascal
PROCEDURE UpdateFeatureLayer;
```

```python

def vs.UpdateFeatureLayer():
    return None
```

## Version
Availability: from Vectorworks 2023
## Category
* GIS